'''
Пользователь вводит строку из четырёх
или более целых чисел, разделённых символом “/”.
Сформируйте словарь, где:
✔второе и третье число являются ключами.
✔первое число является значением для первого ключа.
✔четвертое и все возможные последующие числа
 хранятся в кортеже как значения второго ключа.'''

nums = tuple(map(int, input().split('/')))
print({nums[1]: nums[0], nums[2]: nums[3:]})